{"topics": [{"topic": "language", "description": "All concepts related to language learning and research"}, {"topic": "math", "description": "pure mathematics. does not include physics or other sciences"}, {"topic": "science", "description": "all sciences except math"}, {"topic": "social-studies", "description": "social science is the study of society and the relationship among individuals within society"}, {"topic": "computer-science", "description": "computer science is the study of the theory, experimentation, and engineering that form the basis for the design and use of computers, this incluces AI and ML"}, {"topic": "art", "description": "art is a diverse range of human activities in creating visual, auditory or performing artifacts"}, {"topic": "physical-education", "description": "physical education is all about our body and how to keep it healthy"}, {"topic": "philosophy", "description": "philosophy is the study of general and fundamental problems concerning matters such as existence, knowledge, values, reason, mind, and language"}, {"topic": "theology", "description": "theology is the systematic study of the nature of the divine and, more broadly, of religious belief"}, {"topic": "psychology", "description": "psychology is the science of behavior and mind, including conscious and unconscious phenomena, as well as feeling and thought"}, {"topic": "sociology", "description": "sociology is the study of society, patterns of social relationships, social interaction, and culture of everyday life"}], "concepts": [{"concept": "machine-learning", "maintainers": ["Elijah", "Tifany"], "summary": "Machine learning is the scientific study of algorithms and statistical models that computer systems use to perform a specific task without using explicit instructions, relying on patterns and inference instead. It is seen as a subset of artificial intelligence. Machine learning algorithms build a mathematical model based on sample data, known as \"training data\", in order to make predictions or decisions without being explicitly programmed to perform the task.", "topic": "computer-science", "tags": []}, {"concept": "artificial-intelligence", "maintainers": ["Elijah", "Tifany"], "summary": "Artificial intelligence (AI) is intelligence demonstrated by machines, unlike the natural intelligence displayed by humans and animals, which involves consciousness and emotionality. The distinction between the former and the latter categories is often revealed by the acronym chosen. 'Strong' AI is usually labelled as artificial general intelligence (AGI) while attempts to emulate 'natural' intelligence have been called artificial biological intelligence (ABI). Leading AI textbooks define the field as the study of \"intelligent agents\": any device that perceives its environment and takes actions that maximize its chance of successfully achieving its goals.", "topic": "computer-science", "tags": []}, {"concept": "algorithms", "maintainers": ["Elijah", "Tifany"], "summary": "In mathematics and computer science, an algorithm is a finite sequence of well-defined, computer-implementable instructions, typically to solve a class of problems or to perform a computation. Algorithms are always unambiguous and are used as specifications for performing calculations, data processing, automated reasoning, and other tasks.", "topic": "computer-science", "tags": []}, {"concept": "programming", "maintainers": ["Elijah", "Tifany"], "summary": "Programming is the process of creating a set of instructions that tell a computer how to perform a task. Programming can be done using a variety of computer \"languages,\" such as SQL, Java, Python, and C++.", "topic": "computer-science", "tags": []}, {"concept": "calculus", "maintainers": ["Elijah", "Tifany"], "summary": "Calculus is the mathematical study of continuous change, in the same way that geometry is the study of shape and algebra is the study of generalizations of arithmetic operations. It has two major branches, differential calculus and integral calculus; the former concerns instantaneous rates of change, and the slopes of curves, while integral calculus concerns accumulation of quantities, and areas under or between curves.", "topic": "math", "tags": []}, {"concept": "geometry", "maintainers": ["Elijah", "Tifany"], "summary": "Geometry is a branch of mathematics concerned with questions of shape, size, relative position of figures, and the properties of space. A mathematician who works in the field of geometry is called a geometer.", "topic": "math", "tags": []}, {"concept": "algebra", "maintainers": ["Elijah", "Tifany"], "summary": "Algebra is one of the broad parts of mathematics, together with number theory, geometry and analysis. In its most general form, algebra is the study of mathematical symbols and the rules for manipulating these symbols; it is a unifying thread of almost all of mathematics. It includes everything from elementary equation solving to the study of abstractions such as groups, rings, and fields.", "topic": "math", "tags": []}, {"concept": "biology", "maintainers": ["Elijah", "Tifany"], "summary": "Biology is the natural science that studies life and living organisms, including their physical structure, chemical processes, molecular interactions, physiological mechanisms, development and evolution. Despite the complexity of the science, there are certain unifying concepts that consolidate it into a single, coherent field. ", "topic": "science", "tags": []}, {"concept": "chemistry", "maintainers": ["Elijah", "Tifany"], "summary": "Chemistry is the scientific discipline involved with elements and compounds composed of atoms, molecules and ions: their composition, structure, properties, behavior and the changes they undergo during a reaction with other substances. In the scope of its subject, chemistry occupies an intermediate position between physics and biology.", "topic": "science", "tags": []}, {"concept": "physics", "maintainers": ["Elijah", "Tifany"], "summary": "Physics is the natural science that studies matter, its motion and behavior through space and time, and the related entities of energy and force. Physics is one of the most fundamental scientific disciplines, and its main goal is to understand how the universe behaves.", "topic": "science", "tags": []}, {"concept": "earth-science", "maintainers": ["Elijah", "Tifany"], "summary": "Earth science or geoscience is an all-embracing term for the sciences related to the planet Earth. It is arguably a special case in planetary science, the Earth being the only known life-bearing planet. There are both reductionist and holistic approaches to Earth sciences. The formal discipline of Earth sciences may include the study of the atmosphere, hydrosphere, oceans and biosphere, as well as the solid earth.", "topic": "science", "tags": []}, {"concept": "civics", "maintainers": ["Elijah", "Tifany"], "summary": "Civics is the study of the theoretical, political and practical aspects of citizenship, as well as its rights and duties; the duties of citizens to each other as members of a political body and to the government.", "topic": "social-studies", "tags": []}, {"concept": "government", "maintainers": ["Elijah", "Tifany"], "summary": "A government is the system or group of people governing an organized community, often a state. In the case of its broad associative definition, government normally consists of legislature, executive, and judiciary. Government is a means by which organizational policies are enforced, as well as a mechanism for determining policy.", "topic": "social-studies", "tags": []}, {"concept": "economics", "maintainers": ["Elijah", "Tifany"], "summary": "Economics is the social science that studies the production, distribution, and consumption of goods and services. Economics focuses on the behaviour and interactions of economic agents and how economies work. Microeconomics analyzes basic elements in the economy, including individual agents and markets, their interactions, and the outcomes of interactions. Individual agents may include, for example, households, firms, buyers, and sellers. Macroeconomics analyzes the entire economy (meaning aggregated production, consumption, savings, and investment) and issues affecting it, including unemployment of resources (labour, capital, and land), inflation, economic growth, and the public policies that address these issues (monetary, fiscal, and other policies).", "topic": "social-studies", "tags": []}, {"concept": "music", "maintainers": ["Elijah", "Tifany"], "summary": "Music is an art form and cultural activity whose medium is sound organized in time.", "topic": "art", "tags": []}, {"concept": "painting", "maintainers": ["Elijah", "Tifany"], "summary": "Painting is the practice of applying paint, pigment, color or other medium to a solid surface (called the \"support\"). The medium is commonly applied to the base with a brush, but other implements, such as knives, sponges, and airbrushes, can be used.", "topic": "art", "tags": []}, {"concept": "drawing", "maintainers": ["Elijah", "Tifany"], "summary": "Drawing is a form of visual art in which a person uses various drawing instruments to mark paper or another two-dimensional medium. Instruments include graphite pencils, pen and ink, various kinds of paints, inked brushes, colored pencils, crayons, charcoal, chalk, pastels, various kinds of erasers, markers, styluses, and various metals (such as silverpoint). Digital drawing is the act of using a computer to draw. Common methods of digital drawing include a stylus or finger on a touchscreen device, stylus- or finger-to-touchpad, or in some cases, a mouse. There are many digital art programs and devices.", "topic": "art", "tags": []}, {"concept": "sculpture", "maintainers": ["Elijah", "Tifany"], "summary": "Sculpture is the branch of the visual arts that operates in three dimensions. It is one of the plastic arts. Durable sculptural processes originally used carving (the removal of material) and modelling (the addition of material, as clay), in stone, metal, ceramics, wood and other materials but, since Modernism, there has been an almost complete freedom of materials and process. A wide variety of materials may be worked by removal such as carving, assembled by welding or modelling, or molded or cast.", "topic": "art", "tags": []}, {"concept": "health", "maintainers": ["Elijah", "Tifany"], "summary": "Health is the level of functional and metabolic efficiency of a living organism. In humans, it is the general condition of a person's mind and body, usually meaning to be free from illness, injury or pain (as in \"good health\" or \"healthy\"). The World Health Organization (WHO) defined health in its broader sense in 1946 as \"a state of complete physical, mental and social well-being and not merely the absence of disease or infirmity.\"", "topic": "physical-education", "tags": []}, {"concept": "fitness", "maintainers": ["Elijah", "Tifany"], "summary": "Physical fitness is a state of health and well-being and, more specifically, the ability to perform aspects of sports, occupations and daily activities. Physical fitness is generally achieved through proper nutrition, moderate-vigorous physical exercise, and sufficient rest.", "topic": "physical-education", "tags": []}, {"concept": "sports", "maintainers": ["Elijah", "Tifany"], "summary": "Sport (or sports) is all forms of usually competitive physical activity which, through casual or organised participation, aim to use, maintain or improve physical ability and skills while providing enjoyment to participants, and in some cases, entertainment for spectators.", "topic": "physical-education", "tags": []}, {"concept": "ethics", "maintainers": ["Elijah", "Tifany"], "summary": "Ethics or moral philosophy is a branch of philosophy that involves systematizing, defending, and recommending concepts of right and wrong conduct. The field of ethics, along with aesthetics, concerns matters of value, and thus comprises the branch of philosophy called axiology.", "topic": "philosophy", "tags": []}, {"concept": "metaphysics", "maintainers": ["Elijah", "Tifany"], "summary": "Metaphysics is the branch of philosophy that examines the fundamental nature of reality, including the relationship between mind and matter, between substance and attribute, and between potentiality and actuality. The word \"metaphysics\" comes from two Greek words that, together, literally mean \"after or behind or among [the study of] the natural\".", "topic": "philosophy", "tags": []}, {"concept": "epistemology", "maintainers": ["Elijah", "Tifany"], "summary": "Epistemology is the branch of philosophy concerned with the theory of knowledge.", "topic": "philosophy", "tags": []}, {"concept": "evil", "maintainers": ["Elijah", "Tifany"], "summary": "Evil, in a general context, is the absence or opposite of that which is described as being good. Often, evil is used to denote profound immorality. In certain religious contexts, evil has been described as a supernatural force. Definitions of evil vary, as does the analysis of its motives. However, elements that are commonly associated with evil involve unbalanced behavior involving expediency, selfishness, ignorance, or neglect.", "topic": "philosophy", "tags": []}, {"concept": "good", "maintainers": ["Elijah", "Tifany"], "summary": "Good is the opposite of evil. Good is a concept of objective benefit, for example to the welfare of an individual or of society. Good may also simply mean that conduct that is legal. However, the specific definition of good in any particular context is relative to the general understanding of what is evil. In the context of ethics, the opposite of good is bad.", "topic": "philosophy", "tags": []}, {"concept": "christianity", "maintainers": ["Elijah", "Tifany"], "summary": "Christianity is an Abrahamic monotheistic religion based on the life and teachings of Jesus of Nazareth. Its adherents, known as Christians, believe that Jesus Christ is the Son of God and savior of all people, whose coming as the Messiah was prophesied in the Old Testament. It is the world's largest religion with about 2.4 billion followers.", "topic": "theology", "tags": []}, {"concept": "islam", "maintainers": ["Elijah", "Tifany"], "summary": "Islam is an Abrahamic monotheistic religion teaching that there is only one God (Allah), and that Muhammad is the messenger of God. It is the world's second-largest religion with over 1.8 billion followers or 24% of the world's population, most commonly known as Muslims. Muslims make up a majority of the population in 50 countries. Islam teaches that God is merciful, all-powerful, unique and has guided humankind through prophets, revealed scriptures and natural signs. The primary scriptures of Islam are the Quran, viewed by Muslims as the verbatim word of God, and the teachings and normative example (called the sunnah, composed of accounts called hadith) of Muhammad (c. 570–8 June 632 CE).", "topic": "theology", "tags": []}, {"concept": "judaism", "maintainers": ["Elijah", "Tifany"], "summary": "Judaism is the ethnic religion of the Jewish people, comprising the collective religious, cultural and legal tradition and civilization of the Jewish people. Judaism is considered by religious Jews to be the expression of the covenant that God established with the Children of Israel. It encompasses a wide body of texts, practices, theological positions, and forms of organization. The Torah is part of the larger text known as the Tanakh or the Hebrew Bible, and supplemental oral tradition represented by later texts such as the Midrash and the Talmud. With between 14.5 and 17.4 million adherents worldwide, Judaism is the tenth largest religion in the world.", "topic": "theology", "tags": []}, {"concept": "developmental-psychology", "maintainers": ["Elijah", "Tifany"], "summary": "Developmental psychology is the scientific study of how and why human beings change over the course of their life. Originally concerned with infants and children, the field has expanded to include adolescence, adult development, aging, and the entire lifespan. Developmental psychologists aim to explain how thinking, feeling, and behaviors change throughout life. This field examines change across three major dimensions: physical development, cognitive development, and socioemotional development.", "topic": "psychology", "tags": []}, {"concept": "abnormal-psychology", "maintainers": ["Elijah", "Tifany"], "summary": "Abnormal psychology is the branch of psychology that studies unusual patterns of behavior, emotion and thought, which may or may not be understood as precipitating a mental disorder. Although many behaviors could be considered as abnormal, this branch of psychology generally deals with behavior in a clinical context. There is a long history of attempts to understand and control behavior deemed to be aberrant or deviant, and there is often cultural variation in the approach taken.", "topic": "psychology", "tags": []}, {"concept": "social-psychology", "maintainers": ["Elijah", "Tifany"], "summary": "Social psychology is the scientific study of how people's thoughts, feelings, and behaviors are influenced by the actual, imagined, or implied presence of others. In this definition, scientific refers to the empirical investigation using the scientific method. The terms thoughts, feelings, and behaviors include all psychological variables that are measurable in a human being. The statement that others' presence may be imagined or implied suggests that humans are malleable to social influences even when alone, such as when watching television or following internalized cultural norms. Social psychologists typically explain human behavior as a result of the interaction of mental states and social situations.", "topic": "psychology", "tags": []}, {"concept": "culture", "maintainers": ["Elijah", "Tifany"], "summary": "Culture is the social behavior and norms found in human societies. Culture is considered a central concept in anthropology, encompassing the range of phenomena that are transmitted through social learning in human societies. Cultural universals are found in all human societies; these include expressive forms like art, music, dance, ritual, religion, and technologies like tool usage, cooking, shelter, and clothing. The concept of material culture covers the physical expressions of culture, such as technology, architecture and art, whereas the immaterial aspects of culture such as principles of social organization (including practices of political organization and social institutions), mythology, philosophy, literature (both written and oral), and science comprise the intangible cultural heritage of a society.", "topic": "sociology", "tags": []}, {"concept": "sexuality", "maintainers": ["Elijah", "Tifany"], "summary": "Sexuality is the capacity to have erotic experiences and responses. Sexuality is experienced and expressed in thoughts, fantasies, desires, beliefs, attitudes, values, behaviors, practices, roles and relationships. Some people engage in various sexual activities as a business transaction. Sexuality is influenced by the interaction of biological, psychological, social, economic, political, cultural, ethical, legal, historical, religious and spiritual factors.", "topic": "sociology", "tags": []}, {"concept": "families", "maintainers": ["Elijah", "Tifany"], "summary": "A family is a domestic group of people, or a number of domestic groups, typically affiliated by birth or marriage, or by comparable legal relationships including domestic partnership, adoption, and fostering. Members of the immediate family may include spouses, parents, brothers, sisters, sons, and daughters. Members of the extended family may include grandparents, aunts, uncles, cousins, nephews, nieces, and siblings-in-law. Sometimes these are also considered members of the immediate family, depending on an individual's specific relationship with them.", "topic": "sociology", "tags": []}, {"concept": "manipulation", "maintainers": ["Elijah", "Tifany"], "summary": "Manipulation is the skillful handling, controlling or using of something or someone. The ability to manipulate is seen as a sign of power. The action of manipulating can be done in many different ways, such as by: physical contact, mental manipulation, trickery, deception, or by using authority. The action of manipulating can also be seen as a way of using people to get what you want.", "topic": "sociology", "tags": []}]}